In [1]:
import pandas as pd

In [4]:
rating = pd.read_csv('ratings.csv')

In [5]:
rating.head(3)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224

In [6]:
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [8]:
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [9]:
movies['genres']

0       Adventure|Animation|Children|Comedy|Fantasy
1                        Adventure|Children|Fantasy
2                                    Comedy|Romance
3                              Comedy|Drama|Romance
4                                            Comedy
                           ...
9737                Action|Animation|Comedy|Fantasy
9738                       Animation|Comedy|Fantasy
9739                                          Drama
9740                               Action|Animation
9741                                         Comedy
Name: genres, Length: 9742, dtype: object

In [10]:
rating.describe()

              userId        movieId         rating     timestamp
count  100836.000000  100836.000000  100836.000000  1.008360e+05
mean      326.127564   19435.295718       3.501557  1.205946e+09
std       182.618491   35530.987199       1.042529  2.162610e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.019124e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8122.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09

In [11]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

In [12]:
joined = rating.merge(movies, on='movieId', how='left')
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [13]:
len(rating)==len(joined)

True

In [14]:
rating_ex = pd.read_csv('ratings_example.txt', sep='\t')

In [15]:
rating_ex

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144

In [17]:
mov_ex = pd.read_csv('movies_example.txt', sep='\t')
mov_ex

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)                     Drama

In [19]:
mov_ex.drop_duplicates(subset='movieId', inplace=True, keep='first')
mov_ex

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller

## Tasks

In [20]:
items_dict = {

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 

    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],

    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]

}

In [21]:
purchase_log = {

    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 

    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]

}

In [25]:
items_df = pd.DataFrame(items_dict)
purchase_df = pd.DataFrame(purchase_log)

In [26]:
items_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   item_id      10 non-null     int64
 1   vendor       10 non-null     object
 2   stock_count  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [28]:
new = items_df.merge(purchase_df, how='outer', on='item_id')

In [30]:
new

    item_id   vendor  stock_count  purchase_id    price
0    417283  Samsung         54.0        101.0  13900.0
1    849734       LG         33.0        101.0   5330.0
2    132223    Apple        122.0        101.0  38200.0
3    573943    Apple         18.0        112.0  49990.0
4     19475       LG        102.0        121.0   9890.0
5   3294095    Apple         43.0        145.0  33000.0
6    382043  Samsung         77.0        145.0  67500.0
7    302948  Samsung        143.0        145.0  34500.0
8    100132       LG         60.0        221.0  11400.0
9    312394      ZTE         19.0          NaN      NaN
10   103845      NaN          NaN        145.0  89900.0

In [33]:
new = items_df.merge(purchase_df, on='item_id', how='inner')
new.count()

item_id        9
vendor         9
stock_count    9
purchase_id    9
price          9
dtype: int64

In [34]:
len(new)

9

In [35]:
new = items_df.merge(purchase_df, how='outer', on='item_id')

In [36]:
new

    item_id   vendor  stock_count  purchase_id    price
0    417283  Samsung         54.0        101.0  13900.0
1    849734       LG         33.0        101.0   5330.0
2    132223    Apple        122.0        101.0  38200.0
3    573943    Apple         18.0        112.0  49990.0
4     19475       LG        102.0        121.0   9890.0
5   3294095    Apple         43.0        145.0  33000.0
6    382043  Samsung         77.0        145.0  67500.0
7    302948  Samsung        143.0        145.0  34500.0
8    100132       LG         60.0        221.0  11400.0
9    312394      ZTE         19.0          NaN      NaN
10   103845      NaN          NaN        145.0  89900.0

In [38]:
new['forecast_sell'] = new['price']*new['stock_count']

new[new['forecast_sell']==max(new['forecast_sell'])]

   item_id   vendor  stock_count  purchase_id    price  forecast_sell
6   382043  Samsung         77.0        145.0  67500.0      5197500.0

In [39]:
new['forecast_sell'].sum()

19729490.0

In [40]:
import os

In [41]:
files = os.listdir('data')

In [42]:
files

['ratings_8.txt',
 'ratings_9.txt',
 'ratings_10.txt',
 'ratings_7.txt',
 'ratings_6.txt',
 'ratings_4.txt',
 'ratings_5.txt',
 'ratings_1.txt',
 'ratings_2.txt',
 'ratings_3.txt']

## Tasks

In [69]:
files = ['setup.py', 'ratings.txt', 'stock_stats.txt', 'movies.txt', 'run.sh', 'game_of_thrones.mov']

In [66]:
data = list(map(lambda x: x if '.txt' in x else continue, files))

SyntaxError: invalid syntax (2618419889.py, line 1)

In [73]:
data = [x for x in files if '.txt' in x]

In [75]:
data

['ratings.txt', 'stock_stats.txt', 'movies.txt']

In [76]:
for root, dirs, files in os.walk('data'):
    print(root, dirs, files)

data ['subfolder'] ['ratings_8.txt', '.DS_Store', 'ratings_9.txt', 'ratings_10.txt', 'ratings_7.txt', 'ratings_6.txt', 'ratings_4.txt', 'ratings_5.txt', 'ratings_1.txt', 'ratings_2.txt', 'ratings_3.txt']
data/subfolder [] ['ratings_8.txt']

## Concat dataframes

In [77]:
data = pd.DataFrame(columns=['userId', 'movieId', 'rating', 'timestamp'])

In [78]:
data

Empty DataFrame
Columns: [userId, movieId, rating, timestamp]
Index: []

In [128]:
data = pd.DataFrame(columns=['userId', 'movieId', 'rating', 'timestamp'])

for filename in os.listdir('data'):
    print(filename)
    if '.txt' in filename:
        temp = pd.read_csv(os.path.join('data', filename), names=['userId', 'movieId', 'rating', 'timestamp'])
        #print(temp.head(2))
        data = pd.concat([data, temp])

data.info()

ratings_8.txt
.DS_Store
ratings_9.txt
ratings_10.txt
ratings_7.txt
ratings_6.txt
ratings_4.txt
ratings_5.txt
ratings_1.txt
ratings_2.txt
ratings_3.txt
<class 'pandas.core.frame.DataFrame'>
Int64Index: 100004 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100004 non-null  object
 1   movieId    100004 non-null  object
 2   rating     100004 non-null  float64
 3   timestamp  100004 non-null  object
dtypes: float64(1), object(3)
memory usage: 3.8+ MB

In [129]:
data.head()

  userId movieId  rating   timestamp
0    483    1573     2.0  1465387568
1    483    1580     3.0  1465387435
2    483    1676     4.0  1465387586
3    483    1682     3.0  1465387384
4    483    1732     5.0  1465387406